// eslint-disable-next-line
export const store: Record<string, any> = {
  state: {
    currentCard: 0,
    cards: [
      {
        id: 1,
        title: `
        Ну что))) у кого-то день рождения?) 
        
        Нажимай на стрелки чтобы увидеть свой подарок)
        `,
      },
      {
        id: 2,
        title: "Ты же не думала, что все будет так просто?)",
      },
      {
        id: 3,
        title: `Я тебя очень люблю и в этот день как обычно желаю тебе всего самого приятного, лучшего, достигать вершин, не бояться топить за свое и своих, радоваться каждым приятным мелочам и постоянно учиться!`,
        image: "heart.png",
      },
      {
        id: 4,
        title: `А теперь...`,
      },
      {
        id: 5,
        title: `Давай посмотрим на тебя, как ты себя вела в прошедшем году!`,
      },
      {
        id: 6,
        title: `Ты была ...`,
      },
      {
        id: 7,
        title: `Красивой,`,
        image: "lady.jpeg",
      },
      {
        id: 8,
        title: `смешной,`,
        image: "lob.jpeg",
      },
      {
        id: 9,
        title: `уткой,`,
        image: `utya.jpeg`,
      },
      {
        id: 10,
        title: `а также ты ...`,
      },
      {
        id: 11,
        title: `мешала спать,`,
        image: `meshaet.jpeg`,
      },
      {
        id: 12,
        title: `неслась сломя голову на врагов,`,
        image: `nesetsya.jpeg`,
      },
      {
        id: 13,
        title: `подсматривала,`,
        image: `podsmatrivaet.jpeg`,
      },
      {
        id: 14,
        title: `слушала лекции,`,
        image: `uchitsya.jpeg`,
      },
      {
        id: 15,
        title: `готовила,`,
        image: `gotovka.jpeg`,
      },
      {
        id: 16,
        title: `и еще готовила,`,
        image: `gotovkavpiter.jpeg`,
      },
      {
        id: 17,
        title: `каталась на коньках,`,
        image: `rozovaya.jpeg`,
      },
      {
        id: 18,
        title: `немного спала в ресторане`,
        image: `spit-v-rest.jpeg`,
      },
      {
        id: 19,
        title: `прихорашивалась,`,
        image: `prikhorashiv.jpeg`,
      },
      {
        id: 20,
        title: `путешествовала,`,
        image: `put1.jpeg`,
      },
      {
        id: 21,
        title: `и еще путешествовала,`,
        image: `put2.jpeg`,
      },
      {
        id: 22,
        title: `и еще путешествовала!`,
        image: `put3.jpeg`,
      },
      {
        id: 23,
        title: `и еще путешествовала???`,
        image: `put4.jpeg`,
      },
      {
        id: 24,
        title: `и еще ...`,
        image: `put5.jpeg`,
      },
      {
        id: 25,
        title: `Это что, получается...`,
      },
      {
        id: 26,
        title: `Ты путешественница?`,
      },
      {
        id: 27,
        title: `Ну раз так, то придется продолжать? Да?)`,
      },
      {
        id: 28,
        title: `Хорошо, осталось сосвем немного до презентации подарка. Как ты поняла, это путешествие, да. Но куда? Какие варианты?`,
      },
      {
        id: 29,
        title: `Нет, правда? Какие варианты? Я, вообще, помню, что ты мне говорила про Плес и домики... Так вот!`,
      },
      {
        id: 30,
        title: `Давай еще сыграем в игру. Я показываю тебе фотку этого места, а ты угадываешь, ок?`,
      },
      {
        id: 31,
        title: `Итак, первая картинка!`,
        image: `guessstart.jpeg`,
      },
      {
        id: 32,
        title: `Поняла? Да?) Что-то все-таки такое, южное... Сочинское!)`,
      },
      {
        id: 33,
        title: `Ладно, если нет, то вот вторая попытка. Тоже что-то с юга, ииии... как будто бы Абхазия, да?) Что-то похожее узнаешь?)`,
        image: `guess1.webp`,
      },
      {
        id: 34,
        title: `Все еще нет?`,
        image: `guess2.jpeg`,
      },
      {
        id: 35,
        title: `Ладно, а если отдалить?`,
        image: `guess3.webp`,
      },
      {
        id: 36,
        title: `Так, возомжно, тебе что-то показалось, но я не это имел в виду. Скорее всего, не ту картинку приложил. Давай проясним ситуацию.`,
      },
      {
        id: 37,
        title: `Готова увидеть свой подарок?`,
      },
      {
        id: 37,
        title: `А вдруг это котенок? Вот было бы круто, да?)`,
      },
      {
        id: 38,
        title: `Ладно, ладно, перестану томить уже тебя, наконец и ...`,
      },
      {
        id: 39,
        title: `... И раскрою тайну, твоего подарка.`,
      },
      {
        id: 40,
        title: `Итак, ты готова?`,
      },
      {
        id: 41,
        title: `Итак, давай обратный отсчет`,
      },
      {
        id: 42,
        title: `3!`,
      },
      {
        id: 43,
        title: `2!`,
      },
      {
        id: 44,
        title: `1!`,
      },
      {
        id: 45,
        title: `Что, уже показывать? Аааа, ну да-да, сейчас, открою в соседней вкладке, сек...`,
      },
      {
        id: 46,
        title: `Итак, еще раз`,
      },
      {
        id: 47,
        title: `3... 2... 1...`,
      },
      {
        id: 48,
        title: `На следующей странице уже ждет подарок`,
      },
      {
        id: 49,
        title: `Блин, и тут нет? Ща, перелестни еще раз`,
      },
      {
        id: 50,
        title: `Ладно, шутки в сторону`,
      },
      {
        id: 51,
        title: `Я тебя еще раз поздравляю с днем рождения, с твоим 24х летием, я помню твою карту желаний из начала года, я хочу исоплнить одно из них. Теперь уже без шуток - на следующей странице тебя ждет подарок. перелистывай!)`,
      },
      {
        id: 52,
        title: `Поздравляю!!!
        Твои билеты по ссылке внизу:)
        `,
        link: {
          href: "https://www.youtube.com/watch?v=dQw4w9WgXcQ",
          text: "Открывай!!!",
        },
      },
      {
        id: 53,
        title: `Блин, не то приложил, ладно, тут же правда - QR и ссылка на билеты! Еще раз с днем рождения, любимая! <3 \nP.S. Надеюсь, ты попросила выходные)`,
        image: `qr.png`,
        link: {
          href: "https://aeroserg.github.io/anzhlk-bday/dubai_tickets.pdf",
          text: "Открывай!!!",
        },
      },
      {
        id: 54,
        title: `Еще я подготовил небольшую памятку. Сначала посмотри билеты, а потом листай дальше.`,
      },
      {
        id: 55,
        title: `Помнишь, я говорил про некое небольшое лакшери?`,
      },
      {
        id: 56,
        title: `Так вот, пусть это и не бизнес-класс, но!
        Я хочу, чтобы мы немного кайфанули и поэтому у нас будет бизнес-зал, правда на вылете из Дубая!`,
      },
      {
        id: 57,
        title: `В Азербайджане все говорят на русском, поэтому не составит труда по указателям пройти в трансферную зону. 
        Если что, по английски надо искать слово transfer и идти по указателям.`,
      },
      {
        id: 58,
        title: `Краткая справка: в Баку сейчас все хорошо, я спрашивал у знакомых. Там отличный аэропорт, так что тоже все гуд. У тебя есть ручная кладь большая, так что бери свой маленький чемодан и рюкзак. Детали по багажу в билетах. Обратно мы с тобой летим вместе также через Баку!`,
      },
      {
        id: 59,
        title: `На следующих слайдах будет краткая памятка по поездке. Ты можешь скопировать текущую ссылку и сохранить ее где-нибудь, если забудешь памятку. Потом, когда откроешь ссылку - тебе сразу высветиться памятка.`,
      },
      {
        id: 59,
        title: `Вылет в 00:55. В аэропорту быть в 20:00. 
        Лучше у гейта оказаться не последней в очереди, просто на всякий случай.
        Ты так обычно и делаешь, просто напоминаю. Также ОБЯЗАТЕЛЬНО зарегистрируйся на стойке информации до конечной точки, то есть до Дубай. Тебе дадут два посадочных. Не потеряй их! Если скажут, что нельзя сразу до конца - в Баку в трансферной зоне зарегистрируешься еще раз.
        Эти рейсы обычно не задерживаются, так что везде успеешь, не переживай.
         `,
      },
      {
        id: 60,
        title: `В 5:15 (по местному времени) ты в Баку. В Баку на час раньше, чем у нас, так что когда прилетишь - все равно смотри внимательно за временем. 
        ОЧЕНЬ ВАЖНО! В Баку не подключайся к мобильной сети. Оставляй телефон в режиме полета весь транзит. В аэропорту есть бесплатный вайфай Baku airport wifi free.
        Еще раз, тебе нужны таблицы с надписью transfer passengers! НЕ получение багажа и НЕ паспортный контроль! ТОЛЬКО transfer. Лучше найди гейт сразу.
        Если будешь сомневатся - большинство людей в аэропорту знают руский, так что не стесняйся, спрашивай их.`,
      },
      {
        id: 61,
        title: `Как только окажешься в зоне трансфера, найди свой новый гейт. 
        Тебе не надо будет никуда спешить, потому что ты уже в аэропорту, не надо идти к гейту за 2 часа. 
        Посадка начинается за 45-60 минут, так что, если переживаешь, иди к гейту за час 15 или час 20.`,
      },
      {
        id: 62,
        title: `
          Ты прилетишь в хороший аэропорт Дубая (DXB). Когда прилетишь - включи сразу esim. Напиши, что долетела.
          Я точно не буду спать уже в это время, так что буду на связи. С такси решим. Скорее всего я тебе закажу такси до дома. 
          Но на всякий случай имей обновленное прилжение яндекс такси российское и примерно тысяч 5 рублей на карте. 
          Такси стоит дешевле, это на всякий случай.
        `,
      },
      {
        id: 62,
        title: `
          В целом это все, я тебе еще дополнительно расскажу и проконсултирую. Esim купим и установим до отлета. Бери купальник, книжки и сумку для пляжа, крем spf и хорошее настроение!)
        `,
      },
    ],
  },
};
