// eslint-disable-next-line
export const store: Record<string, any> = {
  state: {
    currentCard: 0,
    cards: [
      {
        id: 1,
        title: `
        Ну что))) у кого-то день рождения?) 
        
        Нажимай на стрелки чтобы увидеть свой подарок)
        `,
      },
      {
        id: 2,
        title: 'Ты же не думала, что все будет так просто?)',
      },
      {
        id: 3,
        title: `Я тебя очень люблю и в этот день как обычно желаю тебе всего самого приятного, лучшего, достигать вершин, не бояться топить за свое и своих, радоваться каждым приятным мелочам и постоянно учиться!`,
        image: 'heart.png'
      },
       {
        id: 4,
        title: `А теперь...`,
      },
      {
        id: 5,
        title: `Давай посмотрим на тебя, как ты себя вела в прошедшем году!`,
      },
      {
        id: 6,
        title: `Ты была ...`,
      },
      {
        id: 7,
        title: `Красивой,`,
        image: 'lady.jpeg'
      },
      {
        id: 8,
         title: `смешной,`,
        image: 'lob.jpeg'
      },
      {
        id: 9,
        title: `уткой,`,
        image: `utya.jpeg`,
      },
      {
        id: 10,
        title: `а также ты ...`,
      },
      {
        id: 11,
        title: `мешала спать,`,
        image: `meshaet.jpeg`,
      },
      {
        id: 12,
        title: `неслась сломя голову на врагов,`,
        image: `nesetsya.jpeg`,
      },
      {
        id: 13,
        title: `подсматривала,`,
        image: `podsmatrivaet.jpeg`,
      },
      {
        id: 14,
        title: `слушала лекции,`,
        image: `uchitsya.jpeg`,
      },
      {
        id: 15,
        title: `готовила,`,
        image: `gotovka.jpeg`,
      },
      {
        id: 16,
        title: `и еще готовила,`,
        image: `gotovkavpiter.jpeg`,
      },
      {
        id: 17,
        title: `каталась на коньках,`,
        image: `rozovaya.jpeg`,
      },
      {
        id: 18,
        title: `немного спала в ресторане`,
        image: `spit-v-rest.jpeg`,
      },
      {
        id: 19,
        title: `прихорашивалась,`,
        image: `prikhorashiv.jpeg`,
      },
      {
        id: 20,
        title: `путешествовала,`,
        image: `put1.jpeg`,
      },
      {
        id: 21,
        title: `и еще путешествовала,`,
        image: `put2.jpeg`,
      },
      {
        id: 22,
        title: `и еще путешествовала!`,
        image: `put3.jpeg`,
      },
      {
        id: 23,
       title: `и еще путешествовала???`,
        image: `put4.jpeg`,
      },
      {
        id: 24,
       title: `и еще ...`,
      image: `put5.jpeg`,
      },
      {
        id: 25,
        title: `Это что, получается...`,
      },
      {
        id: 26,
        title: `Ты путешественница?`,
      },
      {
        id: 27,
        title: `Ну раз так, то придется продолжать? Да?)`,
      },
      {
        id: 28,
        title: `Хорошо, осталось сосвем немного до презентации подарка. Как ты поняла, это путешествие, да. Но куда? Какие варианты?`,
      },
      {
        id: 29,
        title: `Нет, правда? Какие варианты? Я, вообще, помню, что ты мне говорила про Плес и домики... Так вот!`,
      },
      {
        id: 30,
        title: `Давай еще сыграем в игру. Я показываю тебе фотку этого места, а ты угадываешь, ок?`,
      },
      {
        id: 31,
        title: `Итак, первая картинка!`,
        image: `guessstart.jpeg`,
      },
      {
        id: 32,
        title: `Поняла? Да?) Что-то все-таки такое, южное... Сочинское!)`,
      },
      {
        id: 33,
        title: `Ладно, если нет, то вот вторая попытка. Тоже что-то с юга, ииии... как будто бы Абхазия, да?) Что-то похожее узнаешь?)`,
        image: `guess1.webp`,
      },
      {
        id: 34,
        title: `Все еще нет?`,
        image: `guess2.jpeg`,
      },
      {
        id: 35,
        title: `Ладно, а если отдалить?`,
        image: `guess3.webp`,
      },
      {
        id: 36,
        title: `Так, возомжно, тебе что-то показалось, но я не это имел в виду. Скорее всего, не ту картинку приложил. Давай проясним ситуацию.`,

      },
      {
        id: 37,
        title: `Готова увидеть свой подарок?`,

      },
       {
        id: 37,
        title: `А вдруг это котенок? Вот было бы круто, да?)`,
      },
      {
        id: 38,
        title: `Ладно, ладно, перестану томить уже тебя, наконец и ...`,
      },
      {
        id: 39,
        title: `... И раскрою тайну, твоего подарка.`,
      },
      {
        id: 40,
        title: `Итак, ты готова?`,
      },
      {
        id: 41,
        title: `Итак, давай обратный отсчет`,
      },
      {
        id: 42,
        title: `3!`,
      },
      {
        id: 43,
        title: `2!`,
      },
      {
        id: 44,
        title: `1!`,
      },
      {
        id: 45,
        title: `Что, уже показывать? Аааа, ну да-да, сейчас, открою в соседней вкладке, сек...`,
      },
      {
        id: 46,
        title: `Итак, еще раз`,
      },
      {
        id: 47,
        title: `3... 2... 1...`,
      },
      {
        id: 48,
        title: `На следующей странице уже ждет подарок`,
      },
      {
        id: 49,
        title: `Блин, и тут нет? Ща, перелестни еще раз`,
      },
      {
        id: 50,
        title: `Ладно, шутки в сторону`,
      },
      {
        id: 51,
        title: `Я тебя еще раз поздравляю с днем рождения, с твоим 24х летием, я помню твою карту желаний из начала года, я хочу исоплнить одно из них. Теперь уже без шуток - на следующей странице тебя ждет подарок. перелистывай!)`,
      },
      {
        id: 52,
        title: `Поздравляю!!!
        Твои билеты по ссылке внизу:)
        `,
        link: {
          href: 'https://www.youtube.com/watch?v=dQw4w9WgXcQ',
          text: 'Открывай!!!',
        },
      },
      {
        id: 53,
        title: `Блин, не то приложил, ладно, тут же правда - QR и ссылка на билеты! Еще раз с днем рождения, любимая! <3 \nP.S. Надеюсь, ты попросила выходные)`,
        image: `qr.png`,
        link: {
          href: 'https://aeroserg.github.io/anzhlk-bday/dubai_tickets.pdf',
          text: 'Открывай!!!',
        },
      },

     
    ],
  },
};